#### 1. 通过字典来创建DataFrame

In [7]:
from pandas import DataFrame, Series
import pandas as pd

persons = {
    'name': ['john', 'edward', 'polly', 'smith'],
    'age': [19, 18, 18, 17],
    'sex': ['男', '男', '女', '男'],
}
# 字典的key作为列索引
data_frame1 = DataFrame(persons)
data_frame1

   age    name sex
0   19    john   男
1   18  edward   男
2   18   polly   女
3   17   smith   男

In [10]:
contries = {
    '俄罗斯': {'2013': 10, '2014': 20, '2015': 30},
    '阿富汗': {'2013': 12, '2014': 25, '2015': 33},
    '新加坡': {'2013': 11, '2014': 22, '2015': 38},
    '柬埔寨': {'2013': 18, '2014': 16, '2015': 27},
}
# 外层key做列索引，内层key做行索引
data_frame3 = DataFrame(contries)
data_frame3

      俄罗斯  新加坡  柬埔寨  阿富汗
2013   10   11   18   12
2014   20   22   16   25
2015   30   38   27   33

#### 2. 通过二维Numpy数组创建DataFrame

In [12]:
import numpy as np

ndarray1 = np.random.randint(1, 10, (3, 4))

# 使用默认行索引和列索引
data_frame2 = DataFrame(ndarray1)
data_frame2

   0  1  2  3
0  3  8  6  4
1  7  1  1  7
2  7  6  3  4

#### 3. 通过列表创建DataFrame

In [17]:
data_frame3 = DataFrame([1, 2, 3, 4, 5])
data_frame4 = DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
data_frame3

   0
0  1
1  2
2  3
3  4
4  5

In [18]:
data_frame4

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

#### 4. DataFrame索引

In [32]:
# 打印DataFrame行索引
contries = {
    '俄罗斯': {'2013': 10, '2014': 20, '2015': 30},
    '阿富汗': {'2013': 12, '2014': 25, '2015': 33},
    '新加坡': {'2013': 11, '2014': 22, '2015': 38},
    '柬埔寨': {'2013': 18, '2014': 16, '2015': 27},
}
# 外层key做列索引，内层key做行索引
data_frame5 = DataFrame(contries)
data_frame5

      俄罗斯  新加坡  柬埔寨  阿富汗
2013   10   11   18   12
2014   20   22   16   25
2015   30   38   27   33

In [33]:
data_frame5.columns

Index(['俄罗斯', '新加坡', '柬埔寨', '阿富汗'], dtype='object')

In [34]:
data_frame5.index

Index(['2013', '2014', '2015'], dtype='object')

In [35]:
data_frame5.index = ['aaa', 'bbb', 'ccc']
data_frame5

     俄罗斯  新加坡  柬埔寨  阿富汗
aaa   10   11   18   12
bbb   20   22   16   25
ccc   30   38   27   33

In [36]:
data_frame5.columns = ['一', '二', '三', '四']
data_frame5

      一   二   三   四
aaa  10  11  18  12
bbb  20  22  16  25
ccc  30  38  27  33